title: Remote enablement of RemoteRegistry service
id: cf357a50-af84-4643-adfe-9aa223920f06
status: experimental
description: Detects remote enablement of Remote Registry service through the SCM
author: Rubén Revuelta
date: 2022/05/20
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|contains:
            - '\System\CurrentControlSet\Services\RemoteRegistry\Start'
        Details:
            - Details: 'DWORD (0x00000003)'
    condition: selection
falsepositives:
     - Unknown
